project/test_automation/hilton-exp/Expedia-Hilton-Booking/TC01.002-bak/HttpRQ1-EXPmakeReservationHOLD.xml

<?xml version="1.0" encoding="utf-8"?>

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">  
  <soap:Header> 
    <Interface xmlns="http://www.newtrade.com/expedia/R14/header" Version="4.0">  
      <PayloadInfo> 
        <CommDescriptor> 
          <Authentication Password="Prod_x2zlfSYB" Username="Expedia"/> 
        </CommDescriptor> 
      </PayloadInfo> 
    </Interface> 
  </soap:Header>  
  <soap:Body> 
    <OTA_HotelResRQ xmlns="http://www.opentravel.org/OTA/2003/05" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" EchoToken="dbdbdda7-ed60-411b-b1a4-f0d8c9420a1b" PrimaryLangID="en-us" ResStatus="Hold" TimeStamp="2018-07-02T02:10:11.5245145-07:00" TransactionIdentifier="c082fec5127b4ae09542b51036151af7" Version="5.001">
      <POS>
        <Source>
          <RequestorID ID="Egencia" ID_Context="Expedia" Type="18"/>
          <BookingChannel>
            <CompanyName>Expedia</CompanyName>
          </BookingChannel>
        </Source>
      </POS>
      <HotelReservations>
        <HotelReservation>
          <UniqueID ID="1067931102" ID_Context="Expedia" Type="14"/>
          <RoomStays>
            <RoomStay>
              <RoomTypes>
                <RoomType NonSmoking="true" RoomTypeCode="K1"/>
              </RoomTypes>
              <RoomRates>
                <RoomRate>
                  <Rates>
                    <Rate EffectiveDate="2018-07-10" ExpireDate="2018-07-11" RateTypeCode="OGEPSF">
                      <Base AmountBeforeTax="262.32" CurrencyCode="USD"/>
                      <Discount AmountBeforeTax="-11.83" CurrencyCode="USD" DiscountCode="EFR"/>
                      <Total AmountAfterTax="294.08" AmountBeforeTax="250.49" CurrencyCode="USD"/>
                    </Rate>
                  </Rates>
                </RoomRate>
              </RoomRates>
              <GuestCounts>
                <GuestCount AgeQualifyingCode="10" Count="1"/>
              </GuestCounts>
              <TimeSpan End="2018-07-11" Start="2018-07-10"/>
              <Guarantee>
                <GuaranteesAccepted>
                  <GuaranteeAccepted>
                    <PaymentCard CardCode="AX" CardNumber="4111111111111111" CardType="1" ExpireDate="1220">
                      <CardHolderName>Test Derbysoft</CardHolderName>
                    </PaymentCard>
                  </GuaranteeAccepted>
                </GuaranteesAccepted>
              </Guarantee>
              <Total AmountAfterTax="294.08" AmountBeforeTax="250.49" CurrencyCode="USD"/>
              <BasicPropertyInfo BrandCode="HI" ChainCode="HH" HotelCode="CHIOH"/>
            </RoomStay>
          </RoomStays>
          <ResGuests>
            <ResGuest>
              <Profiles>
                <ProfileInfo>
                  <Profile>
                    <Customer>
                      <PersonName>
                        <GivenName>Test</GivenName>
                        <Surname>Derbysoft</Surname>
                      </PersonName>
                      <Telephone AreaCityCode="2" CountryAccessCode="12" Extension="" PhoneNumber="1234567"/>
                      <Telephone AreaCityCode="3" CountryAccessCode="13" Extension="" PhoneNumber="2345678"/>
                    </Customer>
                  </Profile>
                </ProfileInfo>
              </Profiles>
            </ResGuest>
          </ResGuests>
          <ResGlobalInfo>
            <HotelReservationIDs>
              <HotelReservationID ResID_Source="Expedia" ResID_Type="34" ResID_Value="CHN01001"/>
            </HotelReservationIDs>
            <Profiles>
              <ProfileInfo>
                <Profile>
                  <Customer>
                    <PersonName>
                      <GivenName>Test</GivenName>
                      <Surname>Derbysoft</Surname>
                    </PersonName>
                  </Customer>
                </Profile>
              </ProfileInfo>
            </Profiles>
          </ResGlobalInfo>
        </HotelReservation>
      </HotelReservations>
    </OTA_HotelResRQ> 
  </soap:Body> 
</soap:Envelope>