atibd/certification3/HotelResRQ_promotion.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://www.opentravel.org/OTA/2003/05">
<soap:Header/>
<soap:Body>
    <ns1:OTA_HotelResRQ Version="1.3" TransactionIdentifier="TEST15">
        <ns1:POS>
            <ns1:Source ERSP_UserID="5m2z3i432"/>
        </ns1:POS>
        <ns1:HotelReservations>
            <ns1:HotelReservation>
                <ns1:RoomStays>
                    <ns1:RoomStay>
                        <ns1:RoomRates>
                            <ns1:RoomRate RatePlanCode="Available">
                                <ns1:Rates>
                                    <ns1:Rate EffectiveDate="2020-12-12">
                                        <ns1:Base AmountAfterTax="10000" CurrencyCode="USD"/>
                                    </ns1:Rate>
                                    <ns1:Rate EffectiveDate="2020-12-13">
                                        <ns1:Base AmountAfterTax="10000" CurrencyCode="USD"/>
                                    </ns1:Rate>
                                    <ns1:Rate EffectiveDate="2020-12-14">
                                        <ns1:Base AmountAfterTax="10000" CurrencyCode="USD"/>
                                    </ns1:Rate>
                                    <ns1:Rate EffectiveDate="2020-12-15">
                                        <ns1:Base AmountAfterTax="10000" CurrencyCode="USD"/>
                                    </ns1:Rate>
                                    <ns1:Rate EffectiveDate="2020-12-16">
                                        <ns1:Base AmountAfterTax="10000" CurrencyCode="USD"/>
                                    </ns1:Rate>
                                    <ns1:Rate EffectiveDate="2020-12-17">
                                        <ns1:Base AmountAfterTax="10000" CurrencyCode="USD"/>
                                    </ns1:Rate>
                                    <ns1:Rate EffectiveDate="2020-12-18">
                                        <ns1:Base AmountAfterTax="0" CurrencyCode="USD"/>
                                    </ns1:Rate>
                                </ns1:Rates>
                            </ns1:RoomRate>
                        </ns1:RoomRates>
                        <ns1:CancelPenalties>
                            <ns1:CancelPenalty>
                                <ns1:Deadline AbsoluteDeadline="This reservation cannot be cancelled." />
                            </ns1:CancelPenalty>
                        </ns1:CancelPenalties>
                        <ns1:GuestCounts>
                            <ns1:GuestCount AgeQualifyingCode="10" Age="24" ResGuestRPH="1"/>
                            <ns1:GuestCount AgeQualifyingCode="10" Age="20" ResGuestRPH="2"/>
                        </ns1:GuestCounts>
                        <ns1:TimeSpan Duration="P0Y0M7D" Start="2020-12-12" End="2020-12-19"/>
                        <ns1:BasicPropertyInfo HotelCode="ZZZHNL-FIT"/>
                    </ns1:RoomStay>
                </ns1:RoomStays>
                <ns1:ResGuests>
                    <ns1:ResGuest>
                        <ns1:Profiles>
                            <ns1:ProfileInfo>
                                <ns1:Profile RPH="1">
                                    <ns1:Customer>
                                        <ns1:PersonName>
                                            <ns1:GivenName>Walter</ns1:GivenName>
                                            <ns1:NamePrefix>Mr</ns1:NamePrefix>
                                            <ns1:Surname>Jenkins</ns1:Surname>
                                        </ns1:PersonName>
                                    </ns1:Customer>
                                </ns1:Profile>
                                <ns1:Profile RPH="2">
                                    <ns1:Customer>
                                        <ns1:PersonName>
                                            <ns1:GivenName>Mary</ns1:GivenName>
                                            <ns1:NamePrefix>Mrs</ns1:NamePrefix>
                                            <ns1:Surname>Jenkins</ns1:Surname>
                                        </ns1:PersonName>
                                    </ns1:Customer>
                                </ns1:Profile>
                            </ns1:ProfileInfo>
                        </ns1:Profiles>
                    </ns1:ResGuest>
                </ns1:ResGuests>
                <ns1:Guarantee>
                    <ns1:GuaranteesAccepted>
                        <ns1:GuaranteeAccepted>
                            <ns1:PaymentCard CardCode="VI" CardNumber="4111111111111111"
                                SeriesCode="123" ExpireDate="0123">
                                <ns1:Address>
                                    <ns1:StateProv>California</ns1:StateProv>
                                    <ns1:AddressLine>653 W Century blvd</ns1:AddressLine>
                                    <ns1:CityName>Los Angeles</ns1:CityName>
                                    <ns1:PostalCode>90210</ns1:PostalCode>
                                    <ns1:CountryName Code="US"/>
                                </ns1:Address>
                                <ns1:CardHolderName>Walter Jenkins</ns1:CardHolderName>
                                <ns1:Telephone PhoneNumber="818-111-2222"/>
                            </ns1:PaymentCard>
                        </ns1:GuaranteeAccepted>
                    </ns1:GuaranteesAccepted>
                </ns1:Guarantee>
            </ns1:HotelReservation>
        </ns1:HotelReservations>
    </ns1:OTA_HotelResRQ>
</soap:Body>
</soap:Envelope>