project/report/20180607/175659_bw-exp/cache/3.000000.txt

['<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><OTA_CancelRQ xmlns="http://www.opentravel.org/OTA/2003/05" CancelType="Cancel" EchoToken="e3a207e0-c983-4e27-b224-bc31cce6c57c" PrimaryLangID="en_US" Target="Test" TimeStamp="2018-06-07T10:00:50.002Z" TransactionIdentifier="4E18FF920B02402789F783700C51A29D" Version="5.000"><UniqueID ID="BW" Instance="CHN" Type="10"/><UniqueID ID="HTL01031" Instance="CNF" Type="14"/><UniqueID ID="CHN01031" Instance="PNR" Type="14"/></OTA_CancelRQ></SOAP-ENV:Body></SOAP-ENV:Envelope>']